## "Дружественные числа"

### Задание

Два натуральных числа называются дружественными, если каждое из них равно сумме всех натуральных делителей другого
(само число при этом не рассматривается в качестве собственного делителя). \
Необходимо найти все пары натуральных дружественных чисел (не равных друг другу), до введенного числа.

### Формат входных данных

Дано одно целое положительное число

### Формат выходных данных

Вывести все пары дружественных чисел, удовлетворяющие условию задачи.

### Решение задачи

```python
n0 = 300
n1=1
while n1<n0:
  n2=n1+1
  while n2<n0:
    x = 1
    sum1 = sum2 = 0
    while x<=n2/2 and (sum1 < n2 or sum2 < n1):
      if n1 % x == 0:
        sum1 += x
      if n2 % x == 0:
        sum2 += x
      x += 1
    if sum1 == n2 and sum2 == n1:
      print(n1, n2)
    n2 += 1
  n1 += 1
```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|  300  | 220 284 |
