## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

```python
n = 9 # длина стороны квадрата. 1<n<20
i=0
while i<n:
  j=0
  s=""
  while j<n:
    if i==j or j==n-i-1:
      s+="#"
    else:
      s+=str(" ")
    j+=1
  print(s)
  i+=1
```
