## "Подсчет длинных слов"

### Задание

Даны две строки s1 и s2. Определите, можно ли составить строку s2, используя только символы из строки s1 (каждую букву можно использовать только один раз).

### Формат входных данных

Даны две строки.

### Формат выходных данных

Вывести "Да", если из символов строки s1 можно составить строку s2 и "Нет", если нельзя.

### Решение задачи

```python
if len(s2)>len(s1):
    print("Нет")
else:
    i=0
    while i<len(s2):
        if s2[i].count(s2) != s2[i].count(s1):
            print("Нет")
            break
        i+=1
    if i==len(s2):
        print("Да")
```

---

